{
  "publications": [
    {
      "title": "MetaConfigurator: A User-Friendly Tool for Editing Structured Data Files",
      "authors": [
        "Felix Neubauer",
        "Paul Bredl",
        "Minye Xu",
        "Keyuriben Patel",
        "Jürgen Pleiss",
        "Benjamin Uekermann"
      ],
      "conference": "Datenbank-Spektrum",
      "date": "2024-05-30",
      "doi": "10.1007/s13222-024-00472-7",
      "abstract": "Textual formats to structure data, such as JSON, XML, and YAML, are widely used for structuring data in various domains, from configuration files to research data. However, manually editing data in these formats can be complex and time-consuming. Graphical user interfaces (GUIs) can significantly reduce manual efforts and assist the user in editing the files, but developing a file-format-specific GUI requires substantial development and maintenance efforts. To address this challenge, we introduce MetaConfigurator: an open-source web application that generates its GUI depending on a given schema. Our approach differs from other schema-to-UI approaches in three key ways: 1) It offers a unified view that combines the benefits of both GUIs and text editors, 2) it enables schema editing within the same tool, and 3) it supports advanced schema features, including conditions and constraints. In this paper, we discuss the design and implementation of MetaConfigurator, backed by insights from a small-scale qualitative user study. The results indicate the effectiveness of our approach in retrieving information from data and schemas and in editing them.",
      "type": "JournalPaper",
      "related_projects": ["MetaConfigurator (Web Tool)"]
    },
    {
      "title": "Data model creation with MetaConfigurator",
      "authors": ["Felix Neubauer"],
      "conference": "University of Stuttgart, Master Thesis",
      "date": "2024-09-30",
      "doi": "10.18419/opus-15126",
      "abstract": "In both research and industry, significant effort is devoted to the creation of standardized data models that ensure data adheres to a specific structure, enabling the development and use of common tools. These models (also called schemas), enable data validation and facilitate collaboration by making data interoperable across various systems. Tools can assist in the creation and maintenance of data models. One such tool is MetaConfigurator, a schema editor and form generator for JSON schema and for JSON/YAML documents. It offers a unified interface that combines a traditional text editor with a graphical user interface (GUI), supporting advanced schema features such as conditions and constraints. In this work, MetaConfigurator is viewed from the perspective of three exemplary real-world use case in fields such as biochemistry and ontology management. Multiple improvements and functionalities are designed and implemented to further assist the user: 1) A more user-friendly schema editor, distinguishing between an easy and an advanced mode based on a novel meta schema builder approach; 2) A CSV import feature for seamless data transition from Excel to the JSON format with schema inference; 3) Snapshot sharing for effortless collaboration; 4) Ontology integration for auto-completion of URIs; and 5) A novel graphical diagram-like schema view for visual schema manipulation. These new functionalities are then applied to the real-world use cases, demonstrating the practical utility and improved accessibility of MetaConfigurator.",
      "type": "MasterThesis",
      "related_projects": ["MetaConfigurator (Web Tool)"]
    },
    {
      "title": "Data Model Creation with MetaConfigurator",
      "abstract": "In both research and industry, significant effort is devoted to the creation of standardized data models that ensure data adheres to a specific structures, enabling the development and use of common tools. These models (also called schemas) enable data validation and facilitate collaboration by making data interoperable across various systems. Tools can assist in the creation and maintenance of data models. We introduce MetaConfigurator [1], an open-source web-based schema editor and form generator for JSON schema and for JSON/YAML documents. It differs from other schema-to-UI approaches in the following ways:\n1) It allows data editing and schema editing within the same tool,\n2) It offers a unified view, which combines the benefits of a GUI, a text editor and a UML-like diagram view, and\n3) It supports advanced schema features, including conditions, constraints and composition.\n\nIn this talk, we demonstrate MetaConfigurator based on a real-world application in the field of Chemistry. We show how the tool can be used to streamline and simplify the process of data model creation. Furthermore, we use the tool to visualize and communicate data models with others. Using MetaConfigurator less mistakes are made and the entry barrier for data model creation is lowered.",
      "authors": ["Felix Neubauer", "Jürgen Pleiss", "Benjamin Uekermann"],
      "conference": "deRSE25 - Conference for Research Software Engineering in Germany",
      "date": "2025-02-25",
      "doi": "10.5281/zenodo.14981537",
      "type": "ConferenceTalk",
      "related_projects": ["MetaConfigurator (Web Tool)"]
    },
    {
      "title": "Data Model Creation with MetaConfigurator",
      "authors": ["Felix Neubauer", "Jürgen Pleiss", "Benjamin Uekermann"],
      "conference": "Datenbanksysteme für Business, Technologie und Web (BTW 2025)",
      "date": "2025-03-05",
      "doi": "10.18420/BTW2025-60",
      "abstract": "In both research and industry, significant effort is devoted to the creation of standardized data models that ensure data adheres to a specific structure, enabling the development and use of common tools. These models (also called schemas), enable data validation and facilitate collaboration by making data interoperable across various systems. Tools can assist in the creation and maintenance of data models.  One such tool is MetaConfigurator, a schema editor and form generator for JSON schema and for JSON/YAML documents. It offers a unified interface that combines a traditional text editor with a graphical user interface (GUI), supporting advanced schema features such as conditions and constraints. Still, schema editing can be complicated for novices, since MetaConfigurator shows all options of JSON schema, which is very expressive. The following improvements and functionalities have been designed and implemented to further assist the user: 1) A more user-friendly schema editor, distinguishing between an easy and an advanced mode based on a novel meta schema builder approach; 2) A CSV import feature for seamless data transition from Excel to JSON with schema inference; 3) Snapshot sharing for effortless collaboration; 4) Ontology integration for auto-completion of URIs; and 5) A novel graphical diagram-like schema view for visual schema manipulation. These new functionalities are then applied to a real-world use case in chemistry, demonstrating the usability and improved accessibility of MetaConfigurator.",
      "type": "ConferencePaper",
      "related_projects": ["MetaConfigurator (Web Tool)"]
    },
    {
      "title": "Standardizing preCICE Adapters with MetaConfigurator",
      "authors": [
        "Felix Neubauer",
        "Gerasimos Chourdakis",
        "Benjamin Uekermann"
      ],
      "conference": "preCICE workshop 2025",
      "date": "2025-09-11",
      "doi": "10.5281/zenodo.17105018",
      "abstract": "Interoperability and standardization are essential for the growing ecosystem of preCICE adapters. We present a JSON Schema-based specification for preCICE adapter configurations, complemented by comprehensive guidelines for adapter development. By formalizing configuration structures, we enable automated validation, tooling support, and improved documentation, while ensuring that adapters themselves adhere to shared standards. As a central tool, MetaConfigurator provides a schema-driven web interface that simplifies the creation and validation of configuration files, lowering the entry barrier for both adapter developers and users. This approach supports the FAIR principles by promoting interoperability and reusability not only of configuration files, but of the adapters and coupling setups themselves, fostering a more robust and sustainable preCICE ecosystem.",
      "type": "Poster",
      "related_projects": [
        "MetaConfigurator (Web Tool)",
        "preCICe (Coupling Library)"
      ]
    },
    {
      "title": "AI-assisted JSON Schema Creation and Mapping",
      "authors": ["Felix Neubauer", "Jürgen Pleiss", "Benjamin Uekermann"],
      "conference": "ACM/IEEE 28th International Conference on Model Driven Engineering Languages and Systems",
      "date": "2025-10-08",
      "doi": "10.1109/MODELS-C68889.2025.00019",
      "abstract": "Model-Driven Engineering (MDE) places models at the core of system and data engineering processes. In the context of research data, these models are typically expressed as schemas that define the structure and semantics of datasets. However, many domains still lack standardized models, and creating them remains a significant barrier, especially for non-experts. We present a hybrid approach that combines large language models (LLMs) with deterministic techniques to enable JSON Schema creation, modification, and schema mapping based on natural language inputs by the user. These capabilities are integrated into the open-source tool MetaConfigurator, which already provides visual model editing, validation, code generation, and form generation from models. For data integration, we generate schema mappings from heterogeneous JSON, CSV, XML, and YAML data using LLMs, while ensuring scalability and reliability through deterministic execution of generated mapping rules. The applicability of our work is demonstrated in an application example in the field of chemistry. By combining natural language interaction with deterministic safeguards, this work significantly lowers the barrier to structured data modeling and data integration for non-experts.",
      "type": "ConferencePaper",
      "related_projects": ["MetaConfigurator (Web Tool)"]
    },
    {
      "title": "AI-assisted JSON Schema Creation and Mapping",
      "authors": ["Felix Neubauer", "Jürgen Pleiss", "Benjamin Uekermann"],
      "conference": "Allotrope Connect Fall 2025 Workshop",
      "date": "2025-10-29",
      "link": "https://www.youtube.com/watch?v=DfS6PgMr1q0",
      "type": "WorkshopTalk",
      "related_projects": ["MetaConfigurator (Web Tool)"]
    },
    {
      "title": "A quick introduction to the coupling library preCICE",
      "authors": [
        "Felix Neubauer",
        "Gerasimos Chourdakis",
        "Benjamin Uekermann"
      ],
      "conference": "COUPLED PROBLEMS 2025",
      "date": "2025-05-27",
      "link": "https://coupled2025.cimne.com/event/contribution/39120852-c766-11ef-94cb-000c29ddfc0c",
      "abstract": "This talk will open the minisymposium and introduce the main concepts of the open-source preCICE coupling library for partitioned, black-box, multi-physics and multiscale simulations. preCICE enables the efficient, robust, and parallel coupling of separate single-physics solvers. This includes, but is not restricted to fluid-structure interaction. preCICE treats these solvers as black-boxes and, thus, only minimally-invasive changes are necessary to prepare a solver for coupling. Ready-to-use adapters for well known open-source solvers, including OpenFOAM, SU2, CalculiX, FEniCS, and deal.II, are available, while the core library is included in the xSDK ecosystem. The software offers methods for equation coupling, fully parallel communication, data mapping, and time interpolation schemes. For more information, please visit https://precice.org/.",
      "type": "ConferenceTalk",
      "related_projects": ["preCICe (Coupling Library)"]
    },
    {
      "title": "preCICE Tooling Overview & News",
      "authors": ["Felix Neubauer", "Frédéric Simonis", "Benjamin Uekermann"],
      "conference": "preCICE workshop 2025",
      "date": "2025-09-11",
      "doi": "10.5281/zenodo.17104911",
      "abstract": "Overview of new automation tools such as the preCICE command-line interface, configuration generator, configuration checker, and more.",
      "type": "WorkshopTalk",
      "related_projects": [
        "MetaConfigurator (Web Tool)",
        "preCICe (Coupling Library)"
      ]
    },
    {
      "title": "Standardizing preCICE Adapters with MetaConfigurator",
      "authors": [
        "Felix Neubauer",
        "Gerasimos Chourdakis",
        "Benjamin Uekermann"
      ],
      "conference": "preCICE workshop 2025",
      "date": "2025-09-11",
      "doi": "10.5281/zenodo.17105018",
      "abstract": "Interoperability and standardization are essential for the growing ecosystem of preCICE adapters. We present a JSON Schema-based specification for preCICE adapter configurations, complemented by comprehensive guidelines for adapter development. By formalizing configuration structures, we enable automated validation, tooling support, and improved documentation, while ensuring that adapters themselves adhere to shared standards. As a central tool, MetaConfigurator provides a schema-driven web interface that simplifies the creation and validation of configuration files, lowering the entry barrier for both adapter developers and users. This approach supports the FAIR principles by promoting interoperability and reusability not only of configuration files, but of the adapters and coupling setups themselves, fostering a more robust and sustainable preCICE ecosystem.",
      "type": "Poster",
      "related_projects": [
        "MetaConfigurator (Web Tool)",
        "preCICe (Coupling Library)"
      ]
    }
  ]
}
